import jieba
jieba.set_dictionary('./dict.txt')

article = (" 作者  fur (英國研究真有趣)                                   看板  Gossiping    "
" 標題  Re: [新聞] 陳吉仲：萊克多巴胺是還好的添加物 好比                          "
" 時間  Wed Nov 24 10:39:09 2021                                                  "
"───────────────────────────────────────                                          "
"                                                                                 "
"※ 引述《electroplate (艾斯卡諾)》之銘言：                                        "
": 備註請放最後面 違者新聞文章刪除                                                "
": 1.媒體來源:                                                                    "
": 新頭殼                                                                         "
": 2.記者署名:                                                                    "
": 林朝億                                                                         "
": 3.完整新聞標題:                                                                "
": 陳吉仲：萊克多巴胺是還好的添加物 好比人也會吃保健食品                          "
"                                                                                 "
"                                                                                 "
"陳吉仲剛剛出來說，他絕對沒有說萊劑是保健食品，                                   "
"啊頭殼也是這樣報啊，                                                             "
"還貼逐字稿，我們來看一下他的逐字稿是怎麼寫的：                                   "
"                                                                                 "
"「【嚴正澄清，本人從未說過萊劑是人類的保健食品】                                 "
"                                                                                 "
"主持人：到底萊克多巴胺是什麼啊，主委？                                           "
"                                                                                 "
"                                                                                 "
"陳吉仲：萊克多巴胺就是一個很簡單的一個產品，就是說，比如說豬你要養讓他長大，最   "
"後提供給我們當豬肉吃的時候，你除了給他吃飼料，飼料就是像玉米阿，或者是黃豆粕把   "
"它混合以外，你要添加一些添加物，就好比是人，我們平常吃三餐，可是你會吃一些保健   "
"食品。」                                                                         "
"                                                                                 "
"廢話，人當然不會吃萊克多巴胺，問題是也沒有人說萊克多巴胺是保健食品，是你自己言   "
"多必失。                                                                         "
"                                                                                 "
"--                                                                               "
"To 小天使: Hey小天使:D                                                           "
"★小天使 小主人請說^^                                                             "
"To 小天使: Hey小天使:D                                                           "
"★小天使 小主人我在聽請說^^                                                       "
"To 小天使: Hey小天使:D                                                           "
"★小天使 幹你娘玩夠沒?                                                            "
"                                                                                 "
"--                                                                               "
"※ 發信站: 批踢踢實業坊(ptt.cc), 來自: 125.227.50.235 (臺灣)                      "
"※ 文章網址: https://www.ptt.cc/bbs/Gossiping/M.1637721552.A.899.html             "
"推 v2tsbasa: 那到底能不能吃啊? 能吃怎麼不進幾櫃吃?   103.77.192.83 11/24 10:41   "
"→ aabbabcd: 奇怪 這些官學經歷都很好 怎麼一個個講   59.127.187.106 11/24 10:41    "
"→ aabbabcd: 話都沒邏輯...                          59.127.187.106 11/24 10:42    "
"  → aabbabcd: 話都沒邏輯...                          59.127.187.106 11/24 10:42  "
"推 solsol: 政府認證的保健食品  請民眾安心服用      115.215.208.125 11/24 10:42   "
"→ pdz:  $_$                                         211.72.53.144 11/24 10:43    "
"→ spzper: 自己說的話當可以變沒說XDD                118.170.30.246 11/24 10:43    "
"推 ga652206: 結果台灣使用要罰250萬                   27.242.186.25 11/24 10:43   "
"推 zxcv112669: 該讓台灣豬也保健一下了吧               36.237.45.27 11/24 10:43   "
"推 ghostxx: 為何有辦法執政前後腦袋裝的東西差這麼多    1.163.241.16 11/24 10:44   "
"→ dosoleil: 把萊劑當補品 就像說抗生素是補品一樣     140.112.25.23 11/24 10:44    "
"推 yannicklatte: 沒空                               223.137.214.67 11/24 10:44   "
"推 marktak: 你也可以吃阿托品阿                      101.136.221.52 11/24 10:46   "
"→ meatbear: 高端業務-陳時中 萊克多巴胺業務-陳吉       38.34.71.20 11/24 10:46    "
"→ meatbear: 仲                                        38.34.71.20 11/24 10:46    "
"→ Tiphareth: 啊就是比喻成人的保健食品沒錯呀....   123.240.211.188 11/24 10:46    "
"推 hoaliy: 美國豬可以吃保健食品，台灣豬卻不行？      101.136.98.93 11/24 10:47   "
"推 hoder: 就氣喘藥吃了肥肉變瘦肉                     120.126.103.6 11/24 10:48   "
"→ Nagasumi: 為了選舉什麼話都得說                  223.141.207.157 11/24 10:49    "
"推 niko0202: 豬農之子 呸  敗類中的敗類              122.201.136.65 11/24 10:50   "
"推 Mradult: 對照當年陳教授講的，可悲官癌患者         114.136.54.55 11/24 10:50   "
"推 f222051618: 垃圾                                  61.57.100.179 11/24 10:53   "
"推 GaussQQ: 保健食品台灣豬不能吃？                   111.71.18.175 11/24 10:53   "
"推 thatislife: 氣喘藥就氣喘藥 變成豬保健食品          1.172.254.58 11/24 10:55   "
"→ thatislife: 豬本身又沒有瘦肉氣喘需求               1.172.254.58 11/24 10:56    "
"推 mmchen: 耍嘴皮最會                               27.242.226.244 11/24 10:56   "
"  推 mmchen: 耍嘴皮最會                               27.242.226.244 11/24 10:56"
"推 yyc1217: 台灣豬：我怕吃太胖                      220.138.48.194 11/24 10:57  "
"→ m13211: 台灣豬養大的台灣因仔                      163.30.85.215 11/24 10:57   "
"推 deann: 台灣豬就不能出保健食品?                   110.26.227.249 11/24 10:58  "
"推 ciplu: 這不就借代嗎                               220.130.83.50 11/24 10:59  "
"推 clairehao: 台灣二大業務 阿中高端 阿吉萊劑        49.216.165.211 11/24 10:59  "
"噓 mynewid: 好比                                     49.216.161.40 11/24 10:59  "
"噓 tools: 難看                                         1.160.2.193 11/24 11:00  "
"推 fytnship: https://tinyurl.com/6jzf2uep 2013       175.182.22.47 11/24 11:01  "
"噓 tearness: 好的 塔綠班                            114.25.226.185 11/24 11:02  "
"→ fytnship: 瘦肉精美豬進口後果嚴重 政府打死也要擋   175.182.22.47 11/24 11:02   "
"推 cowboyz1105: 就業務嘴啊 死的都能說成活的          49.217.193.78 11/24 11:03  "
"噓 mynewid: 台灣人不如美國豬                         49.216.161.40 11/24 11:05  "
"→ ericlin121: http://i.imgur.com/v7jTTdA.jpg        112.78.76.108 11/24 11:18   "
"噓 wsmallmau: 這就是主委跟教授的水準                49.217.134.163 11/24 11:21  "
"噓 cloudyoyo: 以前當教授時不是這樣講喔                49.216.45.44 11/24 11:27  "
"推 wirecut: 不是人的 是豬的？可以這樣解釋嗎？        27.240.225.92 11/24 11:29  "
"推 km612tw: 是不是只有腦殘才能加入塔綠共            114.32.209.229 11/24 11:39  "
"推 lonelygroup: 為何台豬不能吃萊劑 讓豬營養不好嗎    42.74.225.151 11/24 11:46  "
"推 windcounter: 民進黨繼續說謊                       223.136.76.71 11/24 11:58  "
"→ k44754: https://i.imgur.com/bpXZy2c.jpg         180.217.133.222 11/24 11:59   "
"推 RAY1203: 民進黨真的把台灣人民當白癡在騙          220.228.146.66 11/24 12:02  "
"→ orangeskit: https://i.imgur.com/QkJvf75.gif        101.12.23.75 11/24 12:06   "
"  → fytnship: 瘦肉精美豬進口後果嚴重 政府打死也要擋   175.182.22.47 11/24 11:02 "
"推 cowboyz1105: 就業務嘴啊 死的都能說成活的          49.217.193.78 11/24 11:03  "
"噓 mynewid: 台灣人不如美國豬                         49.216.161.40 11/24 11:05  "
"→ ericlin121: http://i.imgur.com/v7jTTdA.jpg        112.78.76.108 11/24 11:18   "
"噓 wsmallmau: 這就是主委跟教授的水準                49.217.134.163 11/24 11:21  "
"噓 cloudyoyo: 以前當教授時不是這樣講喔                49.216.45.44 11/24 11:27  "
"推 wirecut: 不是人的 是豬的？可以這樣解釋嗎？        27.240.225.92 11/24 11:29  "
"推 km612tw: 是不是只有腦殘才能加入塔綠共            114.32.209.229 11/24 11:39  "
"推 lonelygroup: 為何台豬不能吃萊劑 讓豬營養不好嗎    42.74.225.151 11/24 11:46  "
"推 windcounter: 民進黨繼續說謊                       223.136.76.71 11/24 11:58  "
"→ k44754: https://i.imgur.com/bpXZy2c.jpg         180.217.133.222 11/24 11:59   "
"推 RAY1203: 民進黨真的把台灣人民當白癡在騙          220.228.146.66 11/24 12:02  "
"→ orangeskit: https://i.imgur.com/QkJvf75.gif        101.12.23.75 11/24 12:06   "
"推 GHowPan: 請問這保健食品哪裡買的到                 220.135.226.4 11/24 12:06  "
"推 Jwfsm: 整黨都沒有專業人士 台灣繼續爛 好爽       180.217.229.162 11/24 12:39  "
"推 fsih: 草菅豬命啊 豬權已死                         39.13.102.103 11/24 12:47  "
"推 changefly: 噁心又難看                             114.32.69.243 11/24 12:47  "
"→ fsih: 豬豬也想吃保健萊劑                          39.13.102.103 11/24 12:47   "
"推 tomjanyan: 台灣真慘，快被塔綠班官員玩爛了          27.52.106.25 11/24 12:58  "
"推 peterjfs: 不管啦！我要抗中爆台                    49.216.132.44 11/24 13:23  "
"推 nrxadsl: 天天雙標跳針，塔綠斑笑你台灣人還是繼續  114.24.242.177 11/24 14:12  "
"→ nrxadsl: 投                                      114.24.242.177 11/24 14:12   "
"推 CW46: 可悲台灣人現在連用Iherb買保健食品都無法      1.200.25.177 11/24 15:00  ")

with open('NTUSD_positive_unicode.txt', encoding='utf-8', mode='r') as f:
   positive_words = []
   for l in f:
       positive_words.append(l.strip())

with open('NTUSD_negative_unicode.txt', encoding='utf-8', mode='r') as f:
   negative_words = []
   for l in f:
       negative_words.append(l.strip())

score = 0

jieba_result = jieba.cut(article, cut_all=False, HMM=True)
# print('/'.join(jieba_result))

for word in jieba_result:
    if word.strip() != "":
        if word in positive_words:
            print(f'詞彙:{word}, 總分:{score}')
            score += 1
        elif word in negative_words:
            print(f'詞彙:{word}, 總分:{score}')
            score -= 1
        else:
            pass

print(f'總分:{score}')

